<template>
  <div class="regulation-page">
    <div class="regulation-content">
       <div class="center-content">
          <h1>家谱海（familytreesea.com）服务条款</h1>
          <div class="regulation-body">
             <h3>一、服务条款的确认和接纳</h3>
             <p>家谱海（http://www.familytreesea.com）及其涉及到的产品、相关软件的所有权和运作权归家谱海网站所有， 家谱海网站享有对本网上一切活动的监督、提示、检查、纠正及处罚等权利。用户通过注册程序阅读本服务条款并点击完成注册，即表示用户与家谱海已达成协议，自愿接受本服务条款的所有内容。如果用户不同意服务条款的条件，则不能获得使用familytreesea.com服务以及注册成为家谱海用户的权利。</p>
             <h3>二、服务保护条款</h3>
             <p>1、 家谱海运用自己的操作系统通过国际互联网络为用户提供各项服务，用户必须:
（1）提供设备，包括个人电脑一台、调制解调器一个及配备上网装置。
（2）个人上网和支付与此服务有关的电话费用。
2、考虑到家谱海产品服务的重要性，用户同意:
（1）提供及时、详尽及准确的个人资料。
（2）不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。
3、用户可授权家谱海向第三方透露其注册资料，否则家谱海不能公开用户的姓名、住址、出件地址、电子邮箱、帐号。除非:
（1）事先获得用户明确授权后，用户要求家谱海或授权某人通过电子邮件服务或其他方式透露这些信息。
（2）相应的法律、法规要求以及按照有关政府主管部门的要求，需要家谱海提供用户的个人资料。
（3）为了维护公众以及家谱海合法利益。
（4）家谱海可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与家谱海同等的保护用户隐私的责任，则家谱海有权将用户的注册资料等提供给该第三方。
（5）在不透露单个用户隐私资料的前提下，家谱海有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
4、如果用户提供的资料不准确，不真实，不合法有效，家谱海保留结束用户使用家谱海各项服务的权利。
用户在享用家谱海各项服务的同时，同意接受家谱海提供的各类信息服务。
5、家谱海定义的信息内容包括:文字、软件、声音、相片、录像、图表；在广告中全部内容；家谱海为用户提供的商业信息等，所有这些内容受版权、商标权、和其它知识产权及所有权法律的保护。所以，用户只能在家谱海授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。
6、如果用户未遵守本服务条款的任何一项，家谱海有权利即终止提供一切服务，并保留通过法律手段追究责任的权利。
7、使用家谱海提供的服务由用户自己承担风险，在适用法律允许的最大范围内，家谱海在任何情况下不就因使用或不能使用家谱海提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。
8、用户须明白，使用家谱海提供的服务涉及到Internet服务和电信增值服务，可能会受到各个环节不稳定因素的影响。因此服务存在因不可抗力、计算机病毒或黑客攻击、国家相关行业主管部门及电信运营商的调整、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。用户须承担以上风险，家谱海不作担保。对因此导致用户不能发送、上传和接受阅读消息、或接发错消息，或无法实现其他通讯条件，家谱海不承担任何责任。
9、用户须明白，在使用家谱海提供的服务存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，家谱海和合作公司对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适用性、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。
10、不得发布或诱导用户分享恶意营销和虚假信息。包括但不限于在家谱海发布非人人公司所属平台的账号、 二维码图、账号名称、账号链接及其他。</p>
             <h3>三、用户使用规则</h3>
             <p>特别提示用户，使用互联网必须遵守国家有关的政策和法律，包括刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由用户负全部责任。 1、用户在申请使用家谱海提供的网络服务时，必须向家谱海提供准确的个人资料，如个人资料有任何变动，必须及时更新。
2、用户注册成功后，家谱海将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
3、用户不得使用家谱海服务发送或传播敏感信息和违反国家法律制度的信息，包括但不限于下列信息:
(a) 反对宪法所确定的基本原则的；
(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
(c) 损害国家荣誉和利益的；
(d) 煽动民族仇恨、民族歧视，破坏民族团结的；
(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；
(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；
(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
(h) 侮辱或者诽谤他人，侵害他人合法权益的；
(i) 含有法律、行政法规禁止的其他内容的。
4、用户在使用家谱海络服务过程中，必须遵循以下原则:
(a) 遵守中国有关的法律和法规；
(b) 不得为任何非法目的而使用网络服务系统；
(c) 遵守所有与网络服务有关的网络协议、规定和程序；
(d) 不得利用家谱海网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；
(e) 不得利用家谱海网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
(f) 不得利用家谱海网络服务系统进行任何不利于本站的行为。
5、使用家谱海站服务，用户应加强个人资料的保护意识，并注意个人密码的密码保护。
6、盗取他人用户帐号或利用网络通讯骚扰他人，均属于非法行为。用户不得采用测试、欺骗等任何非法手段，盗取其他用户的帐号和对他人进行骚扰。</p>
            <h3>四、服务条款的修改</h3>
            <p>家谱海会在必要时修改服务条款，服务条款一旦发生变动，公司将会在用户进入下一步使用前的页面提示修改内容。如果您同意改动，则再一次激活"我同意"按钮。如果您不接受，则及时取消您的用户使用服务资格。
用户要继续使用家谱海各项服务需要两方面的确认:
（1）首先确认家谱海服务条款及其变动。
（2）同意接受所有的服务条款限制。</p>
           <h3>五、服务修订</h3>
           <p>家谱海特别提示用户，家谱海为了保障公司业务发展和调整的自主权， 家谱海拥有随时修改或中断服务而不需通知用户的权利，家谱海行使修改或中断服务的权利不需对用户或任何第三方负责。用户必须在同意本条款的前提下，家谱海才开始对用户提供服务。</p>
          <h3>六、用户隐私制度</h3>
          <p>尊重用户个人隐私是家谱海的一项基本政策。所以，作为对以上第二点个人注册资料分析的补充，家谱海一定不会公开、编辑或透露用户的注册资料及保存在家谱海各项服务中的非公开内容，除非家谱海在诚信的基础上认为透露这些信息在以下几种情况是必要的:
（1）遵守有关法律规定，包括在国家有关机关查询时，提供用户在家谱海的网页上发布的信息内容及其发布时间、互联网地址或者域名以及其他用户上传至家谱海的信息。
（2）遵从家谱海产品服务程序。
（3）保持维护家谱海的商标所有权。
（4）在紧急情况下维护用户个人和社会大众的隐私安全。
（5）家谱海认为必要的其他情况下。
用户在此授权家谱海可以向其电子邮箱发送商业信息。</p>
            <h3>七、用户的帐号、密码和安全性</h3>
            <p>用户一旦成功注册，将得到一个密码和帐号。如果用户未保管好自己的帐号和密码而对其自身、家谱海或第三方造成的损害，用户将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。用户可随时改变自己的密码和图标，也可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告家谱海。</p>
            <h3>八、拒绝提供担保</h3>
            <p>用户明确同意邮件服务的使用由用户个人承担风险。邮件服务提供是建立在免费的基础上。家谱海明确表示不提供任何类型的担保，不论是明确的或隐含的。 家谱海不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、出错发生都不作担保。家谱海拒绝提供任何担保，包括信息能否准确、及时、顺利地传送。 用户理解并接受下载或通过家谱海产品服务取得的任何信息资料取决于用户自己，并由其承担系统受损或资料丢失的所有风险和责任。家谱海对在服务网上得到的任何商品购物服务或交易进程，都不作担保。用户不会从家谱海收到口头或书面的意见或信息，家谱海也不会在这里作明确担保。</p>
            <h3>九、有限责任</h3>
            <p>家谱海对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自:不正当使用产品服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。用户的上述行为引起对家谱海或第三方的损害，应当依法承担责任并向家谱海进行赔偿，家谱海可以自行或协助第三方使用用户提供的任何信息进行维权。</p>
            <h3>十、未经家谱海同意禁止进行商业性行为</h3>
            <p>用户承诺不经家谱海书面同意，不能利用家谱海各项服务在家谱海或相关网站上进行销售或其他商业性行为。用户违反此约定，家谱海将依法追究其违约责任，由此给家谱海造成损失的，家谱海有权进行追偿。</p>
            <h3>十一、家谱海用户信息的储存及限制</h3>
            <p>家谱海不对用户所发布信息的删除或储存失败负责。家谱海保留判定用户的行为是否符合家谱海服务条款的要求和精神的权利，如果用户违背了服务条款的规定，则中断或删除其虚拟社区服务的帐号。</p>
            <h3>十二、保障</h3>
            <p>用户同意保障和维护家谱海全体成员的利益，负责支付由用户违反本服务条款或为纠正用户的违反行为所引起的律师费用、诉讼费用、公正费用、鉴定费用、执行费用等，以及因违反服务条款的引起损害赔偿费用，其他人使用用户的电脑、帐号和其它知识产权的追索费。 如用户的密码、帐户被盗用，除非该事件由于家谱海的过失导致，否则用户应承担被盗用期间产生的一切责任和后果。</p>
            <h3>十三、结束服务</h3>
            <p>用户或家谱海可随时根据实际情况中断服务。家谱海不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对家谱海服务不满，用户享有以下的追索权:
（1）不再使用家谱海及（或）家谱海的服务。
（2）结束用户使用家谱海及（或）家谱海服务的资格。
（3）书面通告家谱海停止该用户的服务。
结束用户服务后，用户使用家谱海服务的权利马上中止。从那时起，家谱海不再对用户承担任何义务</p>
            <h3>十四、通告</h3>
            <p>所有发给用户的通告都可通过电子邮件或常规的信件传送。家谱海会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。同时， 家谱海保留对家谱海用户投放商业性广告的权利。</p>
            <h3>十五、参与广告策划</h3>
            <p>在家谱海书面许可下用户可在他们发表的信息中加入宣传资料或参与广告策划，在家谱海各项免费服务上展示他们的产品。任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。 家谱海不承担任何责任，家谱海没有义务为这类广告销售负任何一部分的责任。</p>
            <h3>十六、关于家谱海增值服务业务</h3>
            <p>只有同意家谱海制订的使用条件和条款的用户才能使用家谱海增值服务。原则上增值服务不做退换，如有特殊情况用户可与站长或其他工作人员协商解决。</p>
            <h3>十七、知识产权</h3>
            <p>用户保证和声明对其所提供的作品拥有完整的合法的著作权或完整的合法的授权可以用于其在家谱海上从事的活动，保证家谱海使用该作品不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户应对其所提供作品因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。对于经用户本人创作并上传到家谱海的文本、图片、图形、音频和/ 或视频等，家谱海保留对其网站所有内容进行实时监控的权利，并有权依其独立判断对任何违反本协议约定的作品实施删除。家谱海对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。因用户作品的违法或侵害第三人的合法权益而导致家谱海或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于家谱海或其关联公司蒙受的上述损失承担全面的赔偿责任。</p>
            <h3>十八、言论</h3>
            <p>用户承诺发表言论要:爱国、守法、自律、真实、文明。不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、危害国家安全的、泄露国家机密的、破坏国家宗教政策和民族团结的以及其它违反法律法规及政策的内容。 若用户的行为不符合以上提到的服务条款，家谱海将作出独立判断立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。</p>
            <h3>十九、内容的所有权</h3>
            <p>内容的定义包括:文字、软件、声音、相片、录象、图表；在广告中的全部内容；电子邮件的全部内容；家谱海虚拟社区服务为用户提供的商业信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在家谱海和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</p>
            <h3>二十、免责与赔偿声明</h3>
            <p>1、若家谱海已经明示其网络服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担。
2、用户明确同意其使用家谱海网络服务所存在的风险将完全由其自己承担；因其使用家谱海服务而产生的一切后果也由其自己承担，家谱海对用户不承担任何责任。
3、家谱海不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
4、用户同意保障和维护家谱海及其他用户的利益，由于用户登录网站内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项下的任何条款而给家谱海或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>
            <h3>二十一、法律</h3>
            <p>用户和家谱海一致同意有关本协议以及使用家谱海的服务产生的争议交由仲裁解决，但是家谱海有权选择采取诉讼方式，并有权选择受理该诉讼的有管辖权的法院。若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。</p>
            <h3>二十三、其他</h3>
            <p>1、 家谱海将视向用户所提供服务内容之特性，要求用户在注册家谱海提供的有关服务时，遵守特定的条件和条款；如该特定条件和条款与以上服务条款有任何不一致之处，则已特定条件和条款为准。
2、本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，其余条款仍应有效并且有约束力。
3、本服务条款执行过程中所产生的任何问题本网站和用户都将友好协商解决。
4、以上条款的解释权归家谱海最终所有。</p>
          </div>
       </div>
    </div>

  </div>
</template>

<script>
import {AXIOS} from '~/common/http-commons'
export default {
    name: 'Regulation',
    data() {
      return {

      }
    },
    methods: {
    },
    created () {

    },
    mounted () {

    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.regulation-page{
  flex-flow: column;
  width: 100%;
  display: flex;
  left: 0;
  position:absolute;
}

.regulation-content {
  width: 100%;
  min-height: 700px;
  background-color: #f1f4f5;
}

.center-content{
  max-width: 850px;
  width: 850px;

  margin: 0 auto;
  height: 100%;
  overflow-y: scroll;
  display: flex;
  flex-direction: column;
}

h1{
   font-size: 14px;
   margin: 0 auto;
   margin-top: 20px;
}

.regulation-body{
  width: 100%;
  font-size: 12px;

}

h3{
  font-size: 13px;
  margin-top: 20px;
}

.bottom{
  flex: 1;
  background-color: #F3F0EC;
}
</style>
